blog/2016-08-26-docker.org
#+TITLE: Docker
#+DATE: 2016-08-13
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 虚拟化
#+JEKYLL_TAGS: Linux 虚拟化
#+JEKYLL_PUBLISHED: true


* NameSpace
=NameSpace= 是在内核级别实现环境隔离的方法
| NameSpace         | 功能                                 |
|-------------------+--------------------------------------|
| PID NameSpace     | PID隔离                              |
| Network NameSpace | 网络设备、网络栈、端口等网络资源隔离 |
| User NameSpace    | 用户和用户组资源隔离                 |
| IPC NameSpace     | 信号量、消息队列和共享内存的隔离     |
| UTS NameSpace     | 主机名和域名的隔离                   |
| Mount NameSpace   | 挂载点(文件系统)隔离                 |
: API: clone(), setns(), unshare()

* CGroup
: Linux Control Group: 内核级别上，限制和控制一个进程组群的资源
** 功能
- =Resource limitation=: 资源限制
- =Prioritization=: 优先级控制
- =Accounting=: 审计和统计，主要为计费
- =Control=: 挂起进程，恢复进程
** CGroups子系统
子系统的设定挂载于 =/sys/fs/cgroug= 中
| 名称       | 功能                                                  |
|------------+-------------------------------------------------------|
| blkio      | 设定块设备的IO限制                                    |
| cpu        | 设定CPU的限制                                         |
| cpuacct    | 报告cgroup中CPU资源使用率                             |
| memory     | 设定内存的使用限制                                    |
| cpuset     | 分配CPU数量和内存数量                                 |
| devices    | 控制对设备的访问                                      |
| freezer    | 挂起或恢复cgroup中的任务                              |
| net_cls    | 使用classid来标记网络数据包，实现基于tc命令的流量控制 |
| perf_event | 使用后使cgroup中的任务可以进行统一的性能测试          |
| hugetlb    | 对HugeTLB(大内存页)系统进行限制                       |
- 相关术语 ::
  - =task=: 进程或线程
  - =cgroup=: 一个独立的资源控制单位，可以包含一个或多个子系统
  - =subsystem=: 子系统
  - =hierarchy=: 层级
- 查询挂载的子系统设定 ::
  #+BEGIN_SRC bash
  mount 
  lssubsys -m  
  #+END_SRC
* 文件系统分层
** AUFS
=UnionFS=: 把不同的物理位置的目录按顺序叠加显示到同一个目录中，对其修改只在最上层的文件夹中生效，CentOS没有整合
#+BEGIN_SRC bash
mount -t aufs -o dirs=/PATH:/PATH none /PATH
#+END_SRC
** Device mapper
=Device mapper= 用于在内核中支持逻辑卷管理的通用设备映射机制，类似于lvm的快照机制
* Docker
** Docker功能
- 隔离应用 
- 维护镜像
- 创建易于分发的应用
- 快速扩展

** Docker组件
- =docker client=: docker的客户端工具，Docker是C/S架构的
- =docker deamon=: Docker守护进程，用户可通过docker client与其交互
- =docker container=: docker的运行实例，容器是一个隔离环境
- =docker link=: 网络
- =docker volume=: 卷
- =image=
  - 镜像文件是只读的，一个镜像可以运行多个container
  - 镜像文件可以通过Dockerfile文件创建，也可以从docker hub/registry下载
- =repository=
  - 公共仓库: Docker hub/registry 
  - 私有仓库: Docker registry

** Docker架构
*** 镜像
镜像包含了启动Docker容器所需要的文件系统层级及其内容，基于 =UnionFS= 采用分层结构实现，最底部两层是 =bootfs= 、 =rootfs= 
- registry :: 保存docker镜像及镜像层次结构和元数据的服务器
  - =repository=: 由具有某个功能的镜像的所有相关版本构成的集合
  - =index=: 管理用户的账号、访问权限、镜像及镜像标签等等相关的索引
- graph :: 负责管理本地所有镜像层级，以及记录其与各容器的连接关系到 =graphDB= 中，位置在 =/var/lib/docker/graph=
- 相关的命令 ::
  - =images=: 列出本地所有镜像文件
  - =search=: 搜索可用的镜像文件
  - =tag=: 给一个镜像文件打一个新的标签
    #+BEGIN_SRC bash
    docker tag IMAGE_ID [REGISRY_HOST:PORT/]NAME[:TAG]
    #+END_SRC
  - =pull=: 从registry下载镜像文件
  - =push=: 上传镜像文件到registry
  - =login/logout=: 登录/注销
  - =build=: 根据Dockerfile创建镜像文件
  - =commit=: 根据容器修改创建镜像文件
  - =rmi=: 删除本地镜像文件
*** 容器
容器是独立运行的一个或一组应用，以及它们运行的环境
- 容器运行的步骤 ::
  1. 检查本地是否存在指定的镜像，不存在则从registry下载
  2. 利用镜像启动容器
  3. 分配一个文件系统，并且在只读的镜像层之外挂载一个可读写层
  4. 从宿主机配置的网桥接口桥接一个虚拟接口给此容器
  5. 从地址池中分配一个地址给容器
  6. 执行用户指定的应用程序
  7. 程序执行完成后，容器即终止
- 相关的命令 ::
  - =run=: 运行一个容器
    #+BEGIN_SRC yaml
    docker run [OPTIONS] IMAGES [COMMAND]
      --name="NAME": 设定容器名称

      -i: 开启交互式模式，即开启STDIN
      -t: 分配一伪终端
      -d: 后台运行容器，常与-f配合使用启动服务
      -f: 前台运行容器中的进程

      --rm: 容器关闭时会自动删除容器和卷(当该卷没有容器使用时)

      --link: 定义容器间的依赖关系，启动该容器前需要先启动所依赖的容器

      --net default: 设置网络模式，默认是桥接到docker0上
      -h HOSTNAME: 设定容器的主机名
      --dns DNS_IP: 设定DNS
      --add-host "HOSTNAME:IP": 添加容器中的hosts记录

      -p [主机IP:][主机端口号:]容器端口号: 将容器端口号映射到主机IP的端口号上，默认为所有IP的随机端口，其实就是添加iptables规则
      -P: 映射所有--expose定义或Dockerfile的EXPOSE定义的端口到随机端口
    #+END_SRC
  - =start=: 启动一个停止的容器
  - =restart=: 重启容器
  - =stop=: 发送SIGTERM信号到一个容器
  - =kill=: 发送SIGKILL信号到一个容器
  - =attach=: 附加至一个运行中的容器中，即试该容器成为前台
  - =log=: 获取一个容器的日志，即其输出的信息
