_posts/2016-08-26-docker.html
---
title: "Docker"
date: 2016-08-13
layout: post
categories: 
- 虚拟化
tags: 
- Linux 
- 虚拟化
published: true
comments: 
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. NameSpace</a></li>
<li><a href="#orgheadline4">2. CGroup</a>
<ul>
<li><a href="#orgheadline2">功能</a></li>
<li><a href="#orgheadline3">CGroups子系统</a></li>
</ul>
</li>
<li><a href="#orgheadline7">3. 文件系统分层</a>
<ul>
<li><a href="#orgheadline5">AUFS</a></li>
<li><a href="#orgheadline6">Device mapper</a></li>
</ul>
</li>
<li><a href="#orgheadline24">4. Docker</a>
<ul>
<li><a href="#orgheadline8">Docker功能</a></li>
<li><a href="#orgheadline9">Docker组件</a></li>
<li><a href="#orgheadline14">Docker架构</a>
<ul>
<li><a href="#orgheadline10">镜像</a></li>
<li><a href="#orgheadline11">容器</a></li>
<li><a href="#orgheadline12">Registry</a></li>
<li><a href="#orgheadline13">Data Volume</a></li>
</ul>
</li>
<li><a href="#orgheadline19">容器的网络模型</a>
<ul>
<li><a href="#orgheadline15">Closed container</a></li>
<li><a href="#orgheadline16">Bridged container</a></li>
<li><a href="#orgheadline17">Joined container</a></li>
<li><a href="#orgheadline18">Open container</a></li>
</ul>
</li>
<li><a href="#orgheadline20">容器的资源限制</a></li>
<li><a href="#orgheadline21">Docker监控命令</a></li>
<li><a href="#orgheadline22">容器的导入和导出</a></li>
<li><a href="#orgheadline23">镜像的保存及装载</a></li>
</ul>
</li>
<li><a href="#orgheadline28">5. Dockerfile</a>
<ul>
<li><a href="#orgheadline25">相关术语</a></li>
<li><a href="#orgheadline26">指令</a></li>
<li><a href="#orgheadline27">构建镜像</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> NameSpace</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>NameSpace</code> 是在内核级别实现环境隔离的方法
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">NameSpace</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PID NameSpace</td>
<td class="org-left">PID隔离</td>
</tr>

<tr>
<td class="org-left">Network NameSpace</td>
<td class="org-left">网络设备、网络栈、端口等网络资源隔离</td>
</tr>

<tr>
<td class="org-left">User NameSpace</td>
<td class="org-left">用户和用户组资源隔离</td>
</tr>

<tr>
<td class="org-left">IPC NameSpace</td>
<td class="org-left">信号量、消息队列和共享内存的隔离</td>
</tr>

<tr>
<td class="org-left">UTS NameSpace</td>
<td class="org-left">主机名和域名的隔离</td>
</tr>

<tr>
<td class="org-left">Mount NameSpace</td>
<td class="org-left">挂载点(文件系统)隔离</td>
</tr>
</tbody>
</table>
<pre class="example">
API: clone(), setns(), unshare()
</pre>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> CGroup</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
Linux Control Group: 内核级别上，限制和控制一个进程组群的资源
</pre>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">功能</h3>
<div class="outline-text-3" id="text-orgheadline2">
<ul class="org-ul">
<li><code>Resource limitation</code>: 资源限制</li>
<li><code>Prioritization</code>: 优先级控制</li>
<li><code>Accounting</code>: 审计和统计，主要为计费</li>
<li><code>Control</code>: 挂起进程，恢复进程</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">CGroups子系统</h3>
<div class="outline-text-3" id="text-orgheadline3">
<p>
子系统的设定挂载于 <code>/sys/fs/cgroug</code> 中
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">blkio</td>
<td class="org-left">设定块设备的IO限制</td>
</tr>

<tr>
<td class="org-left">cpu</td>
<td class="org-left">设定CPU的限制</td>
</tr>

<tr>
<td class="org-left">cpuacct</td>
<td class="org-left">报告cgroup中CPU资源使用率</td>
</tr>

<tr>
<td class="org-left">memory</td>
<td class="org-left">设定内存的使用限制</td>
</tr>

<tr>
<td class="org-left">cpuset</td>
<td class="org-left">分配CPU数量和内存数量</td>
</tr>

<tr>
<td class="org-left">devices</td>
<td class="org-left">控制对设备的访问</td>
</tr>

<tr>
<td class="org-left">freezer</td>
<td class="org-left">挂起或恢复cgroup中的任务</td>
</tr>

<tr>
<td class="org-left">net_cls</td>
<td class="org-left">使用classid来标记网络数据包，实现基于tc命令的流量控制</td>
</tr>

<tr>
<td class="org-left">perf_event</td>
<td class="org-left">使用后使cgroup中的任务可以进行统一的性能测试</td>
</tr>

<tr>
<td class="org-left">hugetlb</td>
<td class="org-left">对HugeTLB(大内存页)系统进行限制</td>
</tr>
</tbody>
</table>
<dl class="org-dl">
<dt>相关术语</dt><dd><ul class="org-ul">
<li><code>task</code>: 进程或线程</li>
<li><code>cgroup</code>: 一个独立的资源控制单位，可以包含一个或多个子系统</li>
<li><code>subsystem</code>: 子系统</li>
<li><code>hierarchy</code>: 层级</li>
</ul></dd>
<dt>查询挂载的子系统设定</dt><dd><div class="org-src-container">

<pre class="src src-bash">mount 
lssubsys -m
</pre>
</div></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">3</span> 文件系统分层</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">AUFS</h3>
<div class="outline-text-3" id="text-orgheadline5">
<p>
<code>UnionFS</code>: 把不同的物理位置的目录按顺序叠加显示到同一个目录中，对其修改只在最上层的文件夹中生效，CentOS没有整合
</p>
<div class="org-src-container">

<pre class="src src-bash">mount -t aufs -o <span style="color: #FD971F;">dirs</span>=/PATH:/PATH none /PATH
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Device mapper</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
<code>Device mapper</code> 用于在内核中支持逻辑卷管理的通用设备映射机制，类似于lvm的快照机制
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-2">
<h2 id="orgheadline24"><span class="section-number-2">4</span> Docker</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8">Docker功能</h3>
<div class="outline-text-3" id="text-orgheadline8">
<ul class="org-ul">
<li>隔离应用</li>
<li>维护镜像</li>
<li>创建易于分发的应用</li>
<li>快速扩展</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Docker组件</h3>
<div class="outline-text-3" id="text-orgheadline9">
<ul class="org-ul">
<li><code>docker client</code>: docker的客户端工具，Docker是C/S架构的</li>
<li><code>docker deamon</code>: Docker守护进程，用户可通过docker client与其交互</li>
<li><code>docker container</code>: docker的运行实例，容器是一个隔离环境</li>
<li><code>docker link</code>: 网络</li>
<li><code>docker volume</code>: 卷</li>
<li><code>image</code>
<ul class="org-ul">
<li>镜像文件是只读的，一个镜像可以运行多个container</li>
<li>镜像文件可以通过Dockerfile文件创建，也可以从docker hub/registry下载</li>
</ul></li>
<li><code>repository</code>
<ul class="org-ul">
<li>公共仓库: Docker hub/registry</li>
<li>私有仓库: Docker registry</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">Docker架构</h3>
<div class="outline-text-3" id="text-orgheadline14">
</div><div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10">镜像</h4>
<div class="outline-text-4" id="text-orgheadline10">
<p>
镜像包含了启动Docker容器所需要的文件系统层级及其内容，基于 <code>UnionFS</code> 采用分层结构实现，最底部两层是 <code>bootfs</code> 、 <code>rootfs</code> 
</p>
<dl class="org-dl">
<dt>registry</dt><dd>保存docker镜像及镜像层次结构和元数据的服务器
<ul class="org-ul">
<li><code>repository</code>: 由具有某个功能的镜像的所有相关版本构成的集合</li>
<li><code>index</code>: 管理用户的账号、访问权限、镜像及镜像标签等等相关的索引</li>
</ul></dd>
<dt>graph</dt><dd>负责管理本地所有镜像层级，以及记录其与各容器的连接关系到 <code>graphDB</code> 中，位置在 <code>/var/lib/docker/graph</code></dd>
<dt>相关的命令</dt><dd><ul class="org-ul">
<li><code>images</code>: 列出本地所有镜像文件</li>
<li><code>search</code>: 搜索可用的镜像文件</li>
<li><p>
<code>tag</code>: 给一个镜像文件打一个新的标签
</p>
<div class="org-src-container">

<pre class="src src-bash">docker tag IMAGE_ID <span style="color: #AE81FF;">[</span>REGISRY_HOST:PORT/<span style="color: #AE81FF;">]</span>NAME<span style="color: #AE81FF;">[</span>:TAG<span style="color: #AE81FF;">]</span>
</pre>
</div></li>
<li><code>pull</code>: 从registry下载镜像文件</li>
<li><code>push</code>: 上传镜像文件到registry</li>
<li><code>login/logout</code>: 登录/注销</li>
<li><code>build</code>: 根据Dockerfile创建镜像文件</li>
<li><code>commit</code>: 根据容器修改创建镜像文件</li>
<li><code>rmi</code>: 删除本地镜像文件</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">容器</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
容器是独立运行的一个或一组应用，以及它们运行的环境
</p>
<dl class="org-dl">
<dt>容器运行的步骤</dt><dd><ol class="org-ol">
<li>检查本地是否存在指定的镜像，不存在则从registry下载</li>
<li>利用镜像启动容器</li>
<li>分配一个文件系统，并且在只读的镜像层之外挂载一个可读写层</li>
<li>从宿主机配置的网桥接口桥接一个虚拟接口给此容器</li>
<li>从地址池中分配一个地址给容器</li>
<li>执行用户指定的应用程序</li>
<li>程序执行完成后，容器即终止</li>
</ol></dd>
<dt>相关的命令</dt><dd><ul class="org-ul">
<li><p>
<code>run</code>: 运行一个容器
</p>
<div class="org-src-container">

<pre class="src src-yaml">docker run [OPTIONS] IMAGES [COMMAND]
  --name=<span style="color: #E6DB74;">"NAME"</span>: &#35774;&#23450;&#23481;&#22120;&#21517;&#31216;

  <span style="color: #FD971F;">-i</span>: &#24320;&#21551;&#20132;&#20114;&#24335;&#27169;&#24335;&#65292;&#21363;&#24320;&#21551;STDIN
  <span style="color: #FD971F;">-t</span>: &#20998;&#37197;&#19968;&#20266;&#32456;&#31471;
  <span style="color: #FD971F;">-d</span>: &#21518;&#21488;&#36816;&#34892;&#23481;&#22120;&#65292;&#24120;&#19982;-f&#37197;&#21512;&#20351;&#29992;&#21551;&#21160;&#26381;&#21153;
  <span style="color: #FD971F;">-f</span>: &#21069;&#21488;&#36816;&#34892;&#23481;&#22120;&#20013;&#30340;&#36827;&#31243;

  <span style="color: #FD971F;">--rm</span>: &#23481;&#22120;&#20851;&#38381;&#26102;&#20250;&#33258;&#21160;&#21024;&#38500;&#23481;&#22120;&#21644;&#21367;(&#24403;&#35813;&#21367;&#27809;&#26377;&#23481;&#22120;&#20351;&#29992;&#26102;)

  <span style="color: #FD971F;">--link</span>: &#23450;&#20041;&#23481;&#22120;&#38388;&#30340;&#20381;&#36182;&#20851;&#31995;&#65292;&#21551;&#21160;&#35813;&#23481;&#22120;&#21069;&#38656;&#35201;&#20808;&#21551;&#21160;&#25152;&#20381;&#36182;&#30340;&#23481;&#22120;

  <span style="color: #FD971F;">--net default</span>: &#35774;&#32622;&#32593;&#32476;&#27169;&#24335;&#65292;&#40664;&#35748;&#26159;&#26725;&#25509;&#21040;docker0&#19978;
  <span style="color: #FD971F;">-h HOSTNAME</span>: &#35774;&#23450;&#23481;&#22120;&#30340;&#20027;&#26426;&#21517;
  <span style="color: #FD971F;">--dns DNS_IP</span>: &#35774;&#23450;DNS
  --add-host <span style="color: #E6DB74;">"HOSTNAME:IP"</span>: &#28155;&#21152;&#23481;&#22120;&#20013;&#30340;hosts&#35760;&#24405;

  <span style="color: #FD971F;">-p [&#20027;&#26426;IP:][&#20027;&#26426;&#31471;&#21475;&#21495;:]&#23481;&#22120;&#31471;&#21475;&#21495;</span>: &#23558;&#23481;&#22120;&#31471;&#21475;&#21495;&#26144;&#23556;&#21040;&#20027;&#26426;IP&#30340;&#31471;&#21475;&#21495;&#19978;&#65292;&#40664;&#35748;&#20026;&#25152;&#26377;IP&#30340;&#38543;&#26426;&#31471;&#21475;&#65292;&#20854;&#23454;&#23601;&#26159;&#28155;&#21152;iptables&#35268;&#21017;
  <span style="color: #FD971F;">-P</span>: &#26144;&#23556;&#25152;&#26377;--expose&#23450;&#20041;&#25110;Dockerfile&#30340;EXPOSE&#23450;&#20041;&#30340;&#31471;&#21475;&#21040;&#38543;&#26426;&#31471;&#21475;
</pre>
</div></li>
<li><code>start</code>: 启动一个停止的容器</li>
<li><code>restart</code>: 重启容器</li>
<li><code>stop</code>: 发送SIGTERM信号到一个容器</li>
<li><code>kill</code>: 发送SIGKILL信号到一个容器</li>
<li><code>attach</code>: 附加至一个运行中的容器中，即试该容器成为前台</li>
<li><code>log</code>: 获取一个容器的日志，即其输出的信息</li>
</ul></dd>
</dl>
</div>
</div>
