blog/2016-08-26-docker.org
*** Registry
- 公共Registry :: =Docker Hub=
- 私有Registry :: 
  - 建立私有Registry
    1. 安装 =docker-registry=
    2. 配置 =/etc/docker-registry.yml=
      #+BEGIN_SRC yaml
      sqlalchemy_index_database: ...:sqlite:////tmp/docker-registry.db  # 配置镜像索引数据库的存储位置，需要有写权限
      #+END_SRC
    3. 启动docker-registry服务
    4. 可以使用nginx反代，使用ssl基于basic做用户认证
  - 配置Docker客户端
    1. 配置 =/etc/sysconfig/docker=
      #+BEGIN_SRC bash
      ADD_REGISTRY='--add-registry 172.16.100.68:5000' 
      INSECURE_REGISTRY='--insecure-registry 172.16.100.68:5000'  # 不使用SSL
      #+END_SRC
    2. push镜像
      #+BEGIN_SRC bash
      docker tag IMAGE_ID REGISRY_HOST:PORT/NAME[:TAG]  # 打标签
      docker push REGISRY_HOST:PORT/NAME[:TAG]  # 上传
      #+END_SRC
    3. pull镜像
      #+BEGIN_SRC bash
      docker pull REGISRY_HOST:PORT/NAME[:TAG]
      #+END_SRC

*** Data Volume
数据卷是供一个或多个容器使用的文件或目录
- 数据卷特性 ::
  - 可以共享于多个容器之间
  - 对数据卷的修改会立即生效
  - 对数据卷的更新与镜像无关
  - 数据卷会一直存在
- 使用数据卷的方式 ::
  - =-v [主机路径:]容器路径=: 将容器路径映射为主机路径，默认主机路径为 =/var/lib/docker/volumes= 下的随机名文件夹
  - 在 =Dockerfile= 中使用 =VOLUME= 指令定义
  - =--volumes-from=容器名=: 授权一个容器访问另一个容器的Volume
- 相关命令使用 ::
  - 删除卷
    #+BEGIN_SRC yaml
    docker rm -v CONTAINER_NAME  # 删除容器的同时删除其卷
    #+END_SRC
  - 备份
    #+BEGIN_SRC bash
    docker run --rm --volumes-from 容器名 -v $(pwd):/backup busybox:latest tar cvf /backup/data.tar /data  # 将容器的卷/data备份到当前目录的data.tar文件
    #+END_SRC

** 容器的网络模型
*** Closed container
- 创建选项: =--net none=
- 仅有一个网络接口: =loopback= 
- 不参与网络通信，仅适用于无须网络通信的应用场景，例如备份、程序调试等
*** Bridged container
- 创建选项: =--net bridge=
- 容器有两个网络接口:  =loopback=, =以太网接口= (桥接到主机的桥上，默认为docker0)
- 如果想要改变默认的桥，则需要在运行docker服务时，使用 =-b= 选项指明要使用的桥
*** Joined container
- 创建选项: =--net container:容器名=
- 共享网络名称空间，共用一个网络接口，用于监控和管理其他容器的网络
*** Open container
- 创建选项: =--net host=
- 容器使用Host的网络名称空间
** 容器的资源限制
使用run命令的选项来限制资源
- =-m=: 限制内存
- =--cpuset-cpus=: 指定运行在哪些cpu上
- =--shm-size=: 限制共享内存，即 =/dev/shm=
** Docker监控命令
- =ps=: 查询容器的相关信息
  #+BEGIN_SRC yaml
  docker ps  # 查询正在运行的容器
  docker ps -a  # 查询所有容器
  #+END_SRC
- =images=: 查看当前主机的镜像信息
- =stats=: 查询容器状态的统计信息，实时监控容器的运行状态
- =inspect=: 查看镜像或容器的底层详细信息
- =top=: 查看正在运行的指定容器中的进程运行状态
- =port=: 查看当前的端口映射
: 其他用于监控容器的镜像: google/cadvisor
** 容器的导入和导出
#+BEGIN_SRC yaml
docker export  # 将容器的文件系统导出为一个tar文件
docker import  # 将一个tar文件中打包为镜像
#+END_SRC
** 镜像的保存及装载
#+BEGIN_SRC bash
docker save -o /PATH/TO/SOMEFILE.TAR NAME[:TAG]  # 将一个镜像保存为一个tar文件
docker load -i /PATH/FROM/SOMEFILE.TAR
#+END_SRC
* Dockerfile
: Dockerfile是由一系列用于根据基础镜像构建新的镜像文件的专用指令序列组成文件，用于构建新的镜像
** 相关术语
- 指令: 选定基础镜像、安装必要的程序、复制配置文件和数据文件、自动运行的服务以及要暴露的端口等，指令一般使用 *大写*
- 换行: 使用 =\= 来将一条命令分成两行
- 注释: 以 =#= 开头的行，必须单独位于一行中
