_posts/2016-08-26-docker.html
<div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12">Registry</h4>
<div class="outline-text-4" id="text-orgheadline12">
<dl class="org-dl">
<dt>公共Registry</dt><dd><code>Docker Hub</code></dd>
<dt>私有Registry</dt><dd><ul class="org-ul">
<li>建立私有Registry
<ol class="org-ol">
<li>安装 <code>docker-registry</code></li>
<li><p>
配置 <code>/etc/docker-registry.yml</code>
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #FD971F;">sqlalchemy_index_database</span>: ...:sqlite:////tmp/docker-registry.db  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#37197;&#32622;&#38236;&#20687;&#32034;&#24341;&#25968;&#25454;&#24211;&#30340;&#23384;&#20648;&#20301;&#32622;&#65292;&#38656;&#35201;&#26377;&#20889;&#26435;&#38480;</span>
</pre>
</div></li>
<li>启动docker-registry服务</li>
<li>可以使用nginx反代，使用ssl基于basic做用户认证</li>
</ol></li>
<li>配置Docker客户端
<ol class="org-ol">
<li><p>
配置 <code>/etc/sysconfig/docker</code>
</p>
<div class="org-src-container">

<pre class="src src-bash"><span style="color: #FD971F;">ADD_REGISTRY</span>=<span style="color: #E6DB74;">'--add-registry 172.16.100.68:5000'</span> 
<span style="color: #FD971F;">INSECURE_REGISTRY</span>=<span style="color: #E6DB74;">'--insecure-registry 172.16.100.68:5000'</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#19981;&#20351;&#29992;SSL</span>
</pre>
</div></li>
<li><p>
push镜像
</p>
<div class="org-src-container">

<pre class="src src-bash">docker tag IMAGE_ID REGISRY_HOST:PORT/NAME<span style="color: #AE81FF;">[</span>:TAG<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25171;&#26631;&#31614;</span>
docker push REGISRY_HOST:PORT/NAME<span style="color: #AE81FF;">[</span>:TAG<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#19978;&#20256;</span>
</pre>
</div></li>
<li><p>
pull镜像
</p>
<div class="org-src-container">

<pre class="src src-bash">docker pull REGISRY_HOST:PORT/NAME<span style="color: #AE81FF;">[</span>:TAG<span style="color: #AE81FF;">]</span>
</pre>
</div></li>
</ol></li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13">Data Volume</h4>
<div class="outline-text-4" id="text-orgheadline13">
<p>
数据卷是供一个或多个容器使用的文件或目录
</p>
<dl class="org-dl">
<dt>数据卷特性</dt><dd><ul class="org-ul">
<li>可以共享于多个容器之间</li>
<li>对数据卷的修改会立即生效</li>
<li>对数据卷的更新与镜像无关</li>
<li>数据卷会一直存在</li>
</ul></dd>
<dt>使用数据卷的方式</dt><dd><ul class="org-ul">
<li><code>-v [主机路径:]容器路径</code>: 将容器路径映射为主机路径，默认主机路径为 <code>/var/lib/docker/volumes</code> 下的随机名文件夹</li>
<li>在 <code>Dockerfile</code> 中使用 <code>VOLUME</code> 指令定义</li>
<li><code>--volumes-from</code>容器名=: 授权一个容器访问另一个容器的Volume</li>
</ul></dd>
<dt>相关命令使用</dt><dd><ul class="org-ul">
<li><p>
删除卷
</p>
<div class="org-src-container">

<pre class="src src-yaml">docker rm -v CONTAINER_NAME  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21024;&#38500;&#23481;&#22120;&#30340;&#21516;&#26102;&#21024;&#38500;&#20854;&#21367;</span>
</pre>
</div></li>
<li><p>
备份
</p>
<div class="org-src-container">

<pre class="src src-bash">docker run --rm --volumes-from &#23481;&#22120;&#21517; -v $<span style="color: #AE81FF;">(</span><span style="color: #F92672;">pwd</span><span style="color: #AE81FF;">)</span>:/backup busybox:latest tar cvf /backup/data.tar /data  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;&#23481;&#22120;&#30340;&#21367;/data&#22791;&#20221;&#21040;&#24403;&#21069;&#30446;&#24405;&#30340;data.tar&#25991;&#20214;</span>
</pre>
</div></li>
</ul></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19">容器的网络模型</h3>
<div class="outline-text-3" id="text-orgheadline19">
</div><div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15">Closed container</h4>
<div class="outline-text-4" id="text-orgheadline15">
<ul class="org-ul">
<li>创建选项: <code>--net none</code></li>
<li>仅有一个网络接口: <code>loopback</code></li>
<li>不参与网络通信，仅适用于无须网络通信的应用场景，例如备份、程序调试等</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16">Bridged container</h4>
<div class="outline-text-4" id="text-orgheadline16">
<ul class="org-ul">
<li>创建选项: <code>--net bridge</code></li>
<li>容器有两个网络接口:  <code>loopback</code>, <code>以太网接口</code> (桥接到主机的桥上，默认为docker0)</li>
<li>如果想要改变默认的桥，则需要在运行docker服务时，使用 <code>-b</code> 选项指明要使用的桥</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17">Joined container</h4>
<div class="outline-text-4" id="text-orgheadline17">
<ul class="org-ul">
<li>创建选项: <code>--net container:容器名</code></li>
<li>共享网络名称空间，共用一个网络接口，用于监控和管理其他容器的网络</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18">Open container</h4>
<div class="outline-text-4" id="text-orgheadline18">
<ul class="org-ul">
<li>创建选项: <code>--net host</code></li>
<li>容器使用Host的网络名称空间</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20">容器的资源限制</h3>
<div class="outline-text-3" id="text-orgheadline20">
<p>
使用run命令的选项来限制资源
</p>
<ul class="org-ul">
<li><code>-m</code>: 限制内存</li>
<li><code>--cpuset-cpus</code>: 指定运行在哪些cpu上</li>
<li><code>--shm-size</code>: 限制共享内存，即 <code>/dev/shm</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21">Docker监控命令</h3>
<div class="outline-text-3" id="text-orgheadline21">
<ul class="org-ul">
<li><p>
<code>ps</code>: 查询容器的相关信息
</p>
<div class="org-src-container">

<pre class="src src-yaml">docker ps  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#35810;&#27491;&#22312;&#36816;&#34892;&#30340;&#23481;&#22120;</span>
docker ps -a  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#26597;&#35810;&#25152;&#26377;&#23481;&#22120;</span>
</pre>
</div></li>
<li><code>images</code>: 查看当前主机的镜像信息</li>
<li><code>stats</code>: 查询容器状态的统计信息，实时监控容器的运行状态</li>
<li><code>inspect</code>: 查看镜像或容器的底层详细信息</li>
<li><code>top</code>: 查看正在运行的指定容器中的进程运行状态</li>
<li><code>port</code>: 查看当前的端口映射</li>
</ul>
<pre class="example">
其他用于监控容器的镜像: google/cadvisor
</pre>
</div>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22">容器的导入和导出</h3>
<div class="outline-text-3" id="text-orgheadline22">
<div class="org-src-container">

<pre class="src src-yaml">docker export  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;&#23481;&#22120;&#30340;&#25991;&#20214;&#31995;&#32479;&#23548;&#20986;&#20026;&#19968;&#20010;tar&#25991;&#20214;</span>
docker import  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;&#19968;&#20010;tar&#25991;&#20214;&#20013;&#25171;&#21253;&#20026;&#38236;&#20687;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23">镜像的保存及装载</h3>
<div class="outline-text-3" id="text-orgheadline23">
<div class="org-src-container">

<pre class="src src-bash">docker save -o /PATH/TO/SOMEFILE.TAR NAME<span style="color: #AE81FF;">[</span>:TAG<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#23558;&#19968;&#20010;&#38236;&#20687;&#20445;&#23384;&#20026;&#19968;&#20010;tar&#25991;&#20214;</span>
docker load -i /PATH/FROM/SOMEFILE.TAR
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-2">
<h2 id="orgheadline28"><span class="section-number-2">5</span> Dockerfile</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
Dockerfile是由一系列用于根据基础镜像构建新的镜像文件的专用指令序列组成文件，用于构建新的镜像
</pre>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">相关术语</h3>
<div class="outline-text-3" id="text-orgheadline25">
<ul class="org-ul">
<li>指令: 选定基础镜像、安装必要的程序、复制配置文件和数据文件、自动运行的服务以及要暴露的端口等，指令一般使用 <b>大写</b></li>
<li>换行: 使用 <code>\</code> 来将一条命令分成两行</li>
<li>注释: 以 <code>#</code> 开头的行，必须单独位于一行中</li>
</ul>
</div>
</div>
