blog/2016-08-26-docker.org
** 指令
- FROM指令 :: 必须是第一个非注释行，用于指定所用到的基础镜像
  #+BEGIN_SRC yaml
  FROM image[:tag][@digest]
    image: 指定镜像文件
    tag: 指定标签
    digest: 对比校验码
  #+END_SRC
- MAINTAINER指令 :: 用于提供信息的指令，如作者信息，一般放在FROM之后
  #+BEGIN_SRC yaml
  MAINTAINER QiuMP <qiumupo@qq.com>
  #+END_SRC
- COPY指令 :: 用于从主机复制文件至正在创建的镜像文件中，其UID和GID均为0
  #+BEGIN_SRC yaml
  COPY src... dest  
  COPY ["src",...,"dest"]  # 路径中有空格
    src: 要复制的源文件或目录，可以使用通配符，只能指定与build同目录的文件
    dest: 镜像文件系统的绝对路径，或相对于WORKDIR的相对路径，若是目录则需要以/结尾
  #+END_SRC
- ADD指令 :: 类似于COPY指令，额外还支持展开本地TAR文件，以及URL路径(下载后文件权限为600)
  #+BEGIN_SRC yaml
  ADD SRC... DEST  
  ADD ["SRC",...,"DEST"]  # 路径中有空格时使用该格式
  #+END_SRC
- ENV指令 :: 定义环境变量，Dockerfile调用格式为 =$variable_name= 或 =${variable_name}=
  #+BEGIN_SRC yaml
  ENV KEY="VALUE" ...  # 可定义多个变量
  #+END_SRC
  - ENV定义的环境变量在镜像运行的整个过程中一直存在，可以使用 =inspect= 命令查看
  - 可以在 =docker run= 启动此镜像时,使用 =--env= 选项来修改指定变量的值
- USER指令 :: 指定运行镜像时或运行Dockerfile文件中的任何RUN/CMD/ENTRYPOINT指令指定的程序时的用户名或UID
  #+BEGIN_SRC bash
  USER uid[:gid]  # uid用户必须存在
  USER username[:groupname]
  #+END_SRC
- WORKDIR指令 :: 用于为Dockerfile中所有的 =RUN/CMD/ENTRYPOINT/COPY/ADD= 指令指定工作目录
  #+BEGIN_SRC yaml
  WORKDIR /var/log
  WORKDIR $VAR
  #+END_SRC
  : WORDIR可出现多次，也可使用相对路径，此时表示相对于前一个WORKDIR指令指定的路径
- VOLUME指令 :: 在容器中创建一个挂载点目录映射到主机路径，默认主机路径为 =/var/lib/docker/volumes=
  #+BEGIN_SRC yaml
  VOLUME mount_point
  VOLUME ["mount_point",...]
  #+END_SRC
  : 如果mount_point路径下事先有文件存在，容器会在卷挂载完成后将此前的文件复制到新挂载的卷中
- RUN指令 :: 用于指定 =docker build= 过程中要运行的命令,而不是docker run此dockerfile构建成的镜像时运行的命令
  #+BEGIN_SRC yaml
  RUN command  # 启动一个shell来运行此命令
  RUN ["execute","param1","param2",...]
  RUN ["/bin/bash","-c",...]  # 相当于 RUN command
  #+END_SRC
  #+BEGIN_SRC yaml
  RUN yum install ... && yum clean all
  #+END_SRC
- CMD指令 :: 指定在 =docker run= 时运行的默认命令或参数，会被docker run的命令行参数所覆盖
  #+BEGIN_SRC yaml
  CMD command  # 启动一个shell来运行此命令
  CMD ["execute","param1","param2",...]
  CMD ["param1","param2",...]  # 为ENTRYPOINT提供默认参数
  #+END_SRC
  : 如果dockerfile中存在多个CMD指令，仅最后一个生效
- ENTRYPOINT指令 :: 类似于CMD指令，但不会被docker run的命令行参数所覆盖，这些命令行参数会作为参数送给 =ENTRYPOINT= 指令指定的程序
  #+BEGIN_SRC yaml
  ENTRYPOINT command  # 启动一个shell来运行此命令
  ENTRYPOINT ["execute","param1","param2",...]
  #+END_SRC
  : docker run的选项 --entrypoint 可以覆盖该指令
- EXPOSE指令 :: 用于为容器指定要暴露的端口
  #+BEGIN_SRC yaml
  EXPOSE port
  EXPOSE port/protocol  # 指定tcp或udp
  #+END_SRC
- ONBUILD指令 :: 当前dockerfile构建出的镜像被用作基础镜像去构建其它镜像时，ONBUILD指令指定的操作才会被执行
  #+BEGIN_SRC yaml
  ONBUILD ADD my.cnf /etc/mysql/my.cnf
  #+END_SRC
  : ONBUILD不能自我嵌套，且不能使用FROM和MAINTAINER指令
**  构建镜像
#+BEGIN_SRC bash
docker build -f PATH/Dockerfile -t NAME:tag PATH  # PATH指定存在Dockerfile的文件夹，Dockerfile默认为该文件夹下的Dockerfile文件
#+END_SRC
