_posts/2016-08-26-docker.html
<div id="outline-container-orgheadline26" class="outline-3">
<h3 id="orgheadline26">指令</h3>
<div class="outline-text-3" id="text-orgheadline26">
<dl class="org-dl">
<dt>FROM指令</dt><dd><p>
必须是第一个非注释行，用于指定所用到的基础镜像
</p>
<div class="org-src-container">

<pre class="src src-yaml">FROM image[:tag][@digest]
  <span style="color: #FD971F;">image</span>: &#25351;&#23450;&#38236;&#20687;&#25991;&#20214;
  <span style="color: #FD971F;">tag</span>: &#25351;&#23450;&#26631;&#31614;
  <span style="color: #FD971F;">digest</span>: &#23545;&#27604;&#26657;&#39564;&#30721;
</pre>
</div></dd>
<dt>MAINTAINER指令</dt><dd><p>
用于提供信息的指令，如作者信息，一般放在FROM之后
</p>
<div class="org-src-container">

<pre class="src src-yaml">MAINTAINER QiuMP <a href="mailto:qiumupo%40qq.com">&lt;qiumupo@qq.com&gt;</a>
</pre>
</div></dd>
<dt>COPY指令</dt><dd><p>
用于从主机复制文件至正在创建的镜像文件中，其UID和GID均为0
</p>
<div class="org-src-container">

<pre class="src src-yaml">COPY src... dest  
COPY [<span style="color: #E6DB74;">"src"</span>,...,<span style="color: #E6DB74;">"dest"</span>]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36335;&#24452;&#20013;&#26377;&#31354;&#26684;</span>
  <span style="color: #FD971F;">src</span>: &#35201;&#22797;&#21046;&#30340;&#28304;&#25991;&#20214;&#25110;&#30446;&#24405;&#65292;&#21487;&#20197;&#20351;&#29992;&#36890;&#37197;&#31526;&#65292;&#21482;&#33021;&#25351;&#23450;&#19982;build&#21516;&#30446;&#24405;&#30340;&#25991;&#20214;
  <span style="color: #FD971F;">dest</span>: &#38236;&#20687;&#25991;&#20214;&#31995;&#32479;&#30340;&#32477;&#23545;&#36335;&#24452;&#65292;&#25110;&#30456;&#23545;&#20110;WORKDIR&#30340;&#30456;&#23545;&#36335;&#24452;&#65292;&#33509;&#26159;&#30446;&#24405;&#21017;&#38656;&#35201;&#20197;/&#32467;&#23614;
</pre>
</div></dd>
<dt>ADD指令</dt><dd><p>
类似于COPY指令，额外还支持展开本地TAR文件，以及URL路径(下载后文件权限为600)
</p>
<div class="org-src-container">

<pre class="src src-yaml">ADD SRC... DEST  
ADD [<span style="color: #E6DB74;">"SRC"</span>,...,<span style="color: #E6DB74;">"DEST"</span>]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#36335;&#24452;&#20013;&#26377;&#31354;&#26684;&#26102;&#20351;&#29992;&#35813;&#26684;&#24335;</span>
</pre>
</div></dd>
<dt>ENV指令</dt><dd><p>
定义环境变量，Dockerfile调用格式为 <code>$variable_name</code> 或 <code>${variable_name}</code>
</p>
<div class="org-src-container">

<pre class="src src-yaml">ENV KEY=<span style="color: #E6DB74;">"VALUE"</span> ...  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21487;&#23450;&#20041;&#22810;&#20010;&#21464;&#37327;</span>
</pre>
</div>
<ul class="org-ul">
<li>ENV定义的环境变量在镜像运行的整个过程中一直存在，可以使用 <code>inspect</code> 命令查看</li>
<li>可以在 <code>docker run</code> 启动此镜像时,使用 <code>--env</code> 选项来修改指定变量的值</li>
</ul></dd>
<dt>USER指令</dt><dd><p>
指定运行镜像时或运行Dockerfile文件中的任何RUN/CMD/ENTRYPOINT指令指定的程序时的用户名或UID
</p>
<div class="org-src-container">

<pre class="src src-bash">USER uid<span style="color: #AE81FF;">[</span>:gid<span style="color: #AE81FF;">]</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">uid&#29992;&#25143;&#24517;&#39035;&#23384;&#22312;</span>
USER username<span style="color: #AE81FF;">[</span>:groupname<span style="color: #AE81FF;">]</span>
</pre>
</div></dd>
<dt>WORKDIR指令</dt><dd><p>
用于为Dockerfile中所有的 <code>RUN/CMD/ENTRYPOINT/COPY/ADD</code> 指令指定工作目录
</p>
<div class="org-src-container">

<pre class="src src-yaml">WORKDIR /var/log
WORKDIR $VAR
</pre>
</div>
<pre class="example">
WORDIR可出现多次，也可使用相对路径，此时表示相对于前一个WORKDIR指令指定的路径
</pre></dd>
<dt>VOLUME指令</dt><dd><p>
在容器中创建一个挂载点目录映射到主机路径，默认主机路径为 <code>/var/lib/docker/volumes</code>
</p>
<div class="org-src-container">

<pre class="src src-yaml">VOLUME mount_point
VOLUME [<span style="color: #E6DB74;">"mount_point"</span>,...]
</pre>
</div>
<pre class="example">
如果mount_point路径下事先有文件存在，容器会在卷挂载完成后将此前的文件复制到新挂载的卷中
</pre></dd>
<dt>RUN指令</dt><dd><p>
用于指定 <code>docker build</code> 过程中要运行的命令,而不是docker run此dockerfile构建成的镜像时运行的命令
</p>
<div class="org-src-container">

<pre class="src src-yaml">RUN command  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#19968;&#20010;shell&#26469;&#36816;&#34892;&#27492;&#21629;&#20196;</span>
RUN [<span style="color: #E6DB74;">"execute"</span>,<span style="color: #E6DB74;">"param1"</span>,<span style="color: #E6DB74;">"param2"</span>,...]
RUN [<span style="color: #E6DB74;">"/bin/bash"</span>,<span style="color: #E6DB74;">"-c"</span>,...]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#30456;&#24403;&#20110; RUN command</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-yaml">RUN yum install ... &amp;&amp; yum clean all
</pre>
</div></dd>
<dt>CMD指令</dt><dd><p>
指定在 <code>docker run</code> 时运行的默认命令或参数，会被docker run的命令行参数所覆盖
</p>
<div class="org-src-container">

<pre class="src src-yaml">CMD command  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#19968;&#20010;shell&#26469;&#36816;&#34892;&#27492;&#21629;&#20196;</span>
CMD [<span style="color: #E6DB74;">"execute"</span>,<span style="color: #E6DB74;">"param1"</span>,<span style="color: #E6DB74;">"param2"</span>,...]
CMD [<span style="color: #E6DB74;">"param1"</span>,<span style="color: #E6DB74;">"param2"</span>,...]  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#20026;ENTRYPOINT&#25552;&#20379;&#40664;&#35748;&#21442;&#25968;</span>
</pre>
</div>
<pre class="example">
如果dockerfile中存在多个CMD指令，仅最后一个生效
</pre></dd>
<dt>ENTRYPOINT指令</dt><dd><p>
类似于CMD指令，但不会被docker run的命令行参数所覆盖，这些命令行参数会作为参数送给 <code>ENTRYPOINT</code> 指令指定的程序
</p>
<div class="org-src-container">

<pre class="src src-yaml">ENTRYPOINT command  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#21551;&#21160;&#19968;&#20010;shell&#26469;&#36816;&#34892;&#27492;&#21629;&#20196;</span>
ENTRYPOINT [<span style="color: #E6DB74;">"execute"</span>,<span style="color: #E6DB74;">"param1"</span>,<span style="color: #E6DB74;">"param2"</span>,...]
</pre>
</div>
<pre class="example">
docker run的选项 --entrypoint 可以覆盖该指令
</pre></dd>
<dt>EXPOSE指令</dt><dd><p>
用于为容器指定要暴露的端口
</p>
<div class="org-src-container">

<pre class="src src-yaml">EXPOSE port
EXPOSE port/protocol  <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25351;&#23450;tcp&#25110;udp</span>
</pre>
</div></dd>
<dt>ONBUILD指令</dt><dd><p>
当前dockerfile构建出的镜像被用作基础镜像去构建其它镜像时，ONBUILD指令指定的操作才会被执行
</p>
<div class="org-src-container">

<pre class="src src-yaml">ONBUILD ADD my.cnf /etc/mysql/my.cnf
</pre>
</div>
<pre class="example">
ONBUILD不能自我嵌套，且不能使用FROM和MAINTAINER指令
</pre></dd>
</dl>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27">构建镜像</h3>
<div class="outline-text-3" id="text-orgheadline27">
<div class="org-src-container">

<pre class="src src-bash">docker build -f PATH/Dockerfile -t NAME:tag PATH  <span style="color: #75715E;"># </span><span style="color: #75715E;">PATH&#25351;&#23450;&#23384;&#22312;Dockerfile&#30340;&#25991;&#20214;&#22841;&#65292;Dockerfile&#40664;&#35748;&#20026;&#35813;&#25991;&#20214;&#22841;&#19979;&#30340;Dockerfile&#25991;&#20214;</span>
</pre>
</div>
</div>
</div>
</div>
